Repository: Svid39/marine_checklist_app
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: Dashboard
ru: Дашборд

source: User
ru: Пользователь

source: Profile Settings
ru: Настройки профиля

source: Start New Check
ru: Начать Новую Проверку

source: Open Deficiencies
ru: Открытые Несоответствия

# checksInProgress
source: Checks In Progress ({count})
ru: Проверки в Процессе ({count})

# completedChecks
source: Completed Checks ({count})
ru: Завершенные Проверки ({count})

source: No active checks
ru: Нет активных проверок

source: No completed checks
ru: Нет завершенных проверок

source: Unknown template
ru: Неизвестный шаблон

# startedOn
source: Started: {date}
ru: Начато: {date}

# completedOn
source: Completed: {date}
ru: Завершено: {date}

# completedOnUnknownDate
source: Completed: Date not specified
ru: Завершено: Дата не указана

# vessel
source: Vessel: {name}
ru: Судно: {name}

# port
source: Port: {name}
ru: Порт: {name}

# captain
source: Captain: {name}
ru: Капитан: {name}

# inspector
source: Inspector: {name}
ru: Проверяющий: {name}

source: Delete check
ru: Удалить проверку

source: Create PDF Report
ru: Создать PDF отчет

source: Error loading data
ru: Ошибка загрузки данных

source: Confirm Deletion
ru: Подтвердите Удаление

# unnamedCheck
source: Unnamed
ru: Без имени

# deleteChecklistConfirmation
source: Are you sure you want to delete the check: "{checklistName}"? This action cannot be undone!
ru: Вы уверены, что хотите удалить проверку: "{checklistName}"?

# enterDeleteToConfirm
source: Please type the word 'Delete' to confirm:
ru: Пожалуйста, введите слово 'Delete' для подтверждения:

source: Cancel
ru: Отмена

# deleteButton
source: DELETE
ru: УДАЛИТЬ

source: Check deleted
ru: Проверка удалена

source: Error deleting
ru: Ошибка удаления

# generatingPdfFor
source: Generating PDF for "{name}"...
ru: Генерация PDF для "{name}"...

source: Report
ru: Отчет

# instanceNotFound
source: Check instance not found
ru: Экземпляр проверки не найден

source: Template not found
ru: Шаблон не найден

# checkReportSubject
source: Check Report: {name}
ru: Отчет о проверке: {name}

source: PDF Error
ru: Ошибка PDF

# errorLoadingTemplates
source: Error loading templates: {error}
ru: Ошибка загрузки шаблонов: {error}

# checkDetailsFor
source: Check details for "{templateName}"
ru: Детали проверки для "{templateName}"

source: Vessel Name
ru: Название Судна

source: Enter or confirm vessel name
ru: Введите или подтвердите название судна

source: Vessel name cannot be empty
ru: Название судна не может быть пустым

source: Port of Check
ru: Порт Проверки

source: Enter port
ru: Введите порт

source: Port cannot be empty
ru: Порт не может быть пустым

# captainNameForCheck
source: Captain's Name (for this check)
ru: Имя Капитана (на эту проверку)

# enterOrConfirmCaptainName
source: Enter or confirm captain's name
ru: Введите или подтвердите имя капитана

# captainNameCannotBeEmpty
source: Captain's name cannot be empty
ru: Имя капитана не может быть пустым

source: Start Check
ru: Начать Проверку

# criticalErrorCreatingCheck
source: Critical error creating check: {error}
ru: Критическая ошибка при создании проверки: {error}

source: Select Check Template
ru: Выбор шаблона проверки

# templatesNotFound
source: Templates not found. Please seed the database.
ru: Шаблоны не найдены. Заполните базу данных.

# version
source: Version: {version}
ru: Версия: {version}

# instanceNotFoundForKey
source: Instance with key {key} not found!
ru: Экземпляр с ключом {key} не найден!

# templateNotFoundForKey
source: Template with key {key} not found!
ru: Шаблон с ключом {key} не найден!

# errorLoadingCheckData
source: Error loading check data: {error}
ru: Ошибка загрузки данных проверки: {error}

source: Other Items
ru: Прочие пункты

source: Edit comment
ru: Редактировать комментарий

source: Add comment
ru: Добавить комментарий

# managePhoto
source: Photo: Manage
ru: Фото: Управление

source: Add photo
ru: Добавить фото

# errorDeletingPhoto
source: Error deleting old item photo file
ru: Ошибка удаления старого файла пункта

source: Camera
ru: Камера

source: Gallery
ru: Галерея

# permissionRequiredFor
source: Permission to access "{permissionName}" is required to add a photo.
ru: Для добавления фото требуется разрешение на доступ к "{permissionName}".

# permissionPermanentlyDenied
source: Please enable the permission in the app settings.
ru: Пожалуйста, включите разрешение в настройках приложения.

source: Processing photo...
ru: Обработка фото...

# photoAddedOrUpdated
source: Photo added/updated
ru: Фото добавлено/обновлено

source: Failed to process photo
ru: Не удалось обработать фото

# photoError
source: Photo error: {error}
ru: Ошибка фото: {error}

# commentToItem
source: Comment on item no. {itemOrder}
ru: Комментарий к п. {itemOrder}

source: Enter comment...
ru: Введите комментарий...

source: Save
ru: Сохранить

# errorSaving
source: Save error!
ru: Ошибка сохранения!

source: Check completed
ru: Проверка завершена

source: Complete Check
ru: Завершить проверку

source: Failed to load check data.
ru: Не удалось загрузить данные проверки.

source: OK
ru: ОК

source: Not OK
ru: Не ОК

source: Create Deficiency?
ru: Создать Несоответствие?

# itemMarkedAsNotOk
source: Item {itemOrder}: {itemText} is marked as "Not OK".
ru: Пункт {itemOrder}: {itemText} отмечен как "Не ОК".

source: Later
ru: Позже

source: Create
ru: Создать

source: Close
ru: Закрыть

source: Delete
ru: Удалить

source: Replace photo
ru: Заменить фото

source: Deficiency List
ru: Список Несоответствий

# pdfReportForDeficienciesTooltip
source: PDF report for deficiencies of the current vessel
ru: PDF отчет по несоответствиям текущего судна

source: Deficiency deleted
ru: Несоответствие удалено

source: Error deleting deficiency
ru: Ошибка удаления несоответствия

# errorHiveBoxesNotOpen
source: Error: Not all Hive boxes are open.
ru: Ошибка: Не все ящики Hive открыты.

# vesselNameNotInProfile
source: Vessel name is not specified in the profile!
ru: Название судна не указано в профиле!

# generatingPdfReportForVessel
source: Generating PDF report for vessel "{vesselName}"...
ru: Генерация PDF отчета для судна "{vesselName}"...

# noDeficienciesFoundForVessel
source: No deficiencies found for vessel "{vesselName}"
ru: Не найдено несоответствий для судна "{vesselName}"

# deficiencyReportForVessel
source: Deficiency report for vessel: {vesselName}
ru: Отчет о несоответствиях для судна: {vesselName}

# statusOpen
source: Open
ru: Открыто

# statusInProgress
source: In Progress
ru: В работе

# statusClosed
source: Closed
ru: Закрыто

# filterAll
source: All
ru: Все

source: No deficiencies registered.
ru: Нет зарегистрированных несоответствий.

# statusLabel
source: Status: {status}
ru: Статус: {status}

# dueDateLabel
source: - Due: {date}
ru: - Срок: {date}

source: Delete deficiency
ru: Удалить несоответствие

source: Add Deficiency
ru: Добавить Несоответствие

source: No description
ru: Без описания

# deleteDeficiencyConfirmation
source: Are you sure you want to delete the deficiency: "{description}"? This action is irreversible!
ru: Вы уверены, что хотите удалить несоответствие: "{description}"? Это действие необратимо!

# deficiencyNotFound
source: Deficiency with key {key} not found!
ru: Несоответствие с ключом {key} не найдено!

# errorLoadingDeficiency
source: Error loading deficiency data
ru: Ошибка загрузки данных несоответствия

source: Deficiency saved
ru: Несоответствие сохранено

source: Error saving deficiency
ru: Ошибка сохранения несоответствия

# pleaseFixErrorsInForm
source: Please fix the errors in the form.
ru: Пожалуйста, исправьте ошибки в форме.

source: New Deficiency
ru: Новое Несоответствие

source: Deficiency Details
ru: Детали Несоответствия

source: Deficiency Description:
ru: Описание Несоответствия:

source: Describe the problem...
ru: Опишите проблему...

source: Status:
ru: Статус:

source: Assigned To:
ru: Кому Поручено:

source: Name or position...
ru: Имя или должность...

source: Due Date:
ru: Срок Устранения:

source: Not set
ru: Не установлен

source: Select due date
ru: Выбрать дату срока

source: Corrective Actions:
ru: Корректирующие Действия:

source: Describe what was done...
ru: Опишите, что было сделано...

source: Resolution Date:
ru: Дата Устранения:

# notSetFeminine
source: Not set
ru: Не установлена

source: Select resolution date
ru: Выбрать дату устранения

source: Deficiency Photo:
ru: Фото Несоответствия:

# viewOrReplacePhoto
source: View/Replace Photo
ru: Просмотреть/Заменить Фото

# addDeficiencyPhoto
source: Add Photo
ru: Добавить Фото

# photoDeleted
source: Item photo deleted
ru: Фото удалено

source: Error deleting file
ru: Ошибка удаления файла

# permissionRequired
source: Permission required for access to {permissionName}
ru: Требуется разрешение для доступа к {permissionName}

source: Settings saved!
ru: Настройки сохранены!

# errorSavingProfile
source: Error saving profile: {error}
ru: Ошибка сохранения профиля: {error}

source: Profile Setup
ru: Настройка Профиля

source: App Settings
ru: Настройки Приложения

source: Your Name:
ru: Ваше Имя:

# yourNameHint
source: E.g., John Smith
ru: Например, Иван Иванов

source: Name cannot be empty
ru: Имя не может быть пустым

source: Your Position:
ru: Ваша Должность:

# yourPositionHint
source: E.g., 2nd Engineer
ru: Например, 2й Механик

source: Position cannot be empty
ru: Должность не может быть пустой

source: Default Vessel Name:
ru: Название Судна (по умолчанию):

# defaultVesselNameHint
source: E.g., MV Example
ru: Например, MV Example

# captainNameForReports
source: Captain's Name (for reports):
ru: Имя Капитана (для отчетов):

# captainNameHint
source: E.g., Peter Jones
ru: Например, Петр Петров

# appLanguage
source: Application Language
ru: Язык приложения
